ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1/%2", Данные.Код, Данные.Ссылка.Оператор);
КонецПроцедуры

Функция ПолучитьНастройкиФормыОператора(Оператор) Экспорт
	
	НастройкиОператора = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор",Оператор);
	
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		
		Возврат НастройкиОператора.НастройкиФорм.Получить();
		
	КонецЕсли;
	
	
КонецФункции

Функция УстановитьНастройкиОператораФормы(НастройкиФормы,Оператор) Экспорт
	
	НастройкиОператора = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор",Оператор);
	
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		
		обНастройкиОператора = НастройкиОператора.ПолучитьОбъект();
		
		обНастройкиОператора.НастройкиФорм = Новый ХранилищеЗначения(НастройкиФормы);
		обНастройкиОператора.Записать();
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекущееКоличествоПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1
	|ИЗ
	|	Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать().Количество();
	
КонецФункции

Функция ПолучитьДоступныеСкладыОператора(Оператор) Экспорт
	НастройкиОператора = ПолучитьНастройкуОператораТСД(Оператор);
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		Возврат НастройкиОператора.Склады.ВыгрузитьКолонку("Склад");
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 

Функция ПолучитьДоступныеПомещенияОператора(Оператор) Экспорт
	НастройкиОператора = ПолучитьНастройкуОператораТСД(Оператор);
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		Возврат НастройкиОператора.Помещения.ВыгрузитьКолонку("Помещение");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьДоступныеЯчейкиОператора(Оператор) Экспорт 
	НастройкиОператора = ПолучитьНастройкуОператораТСД(Оператор);
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		Возврат НастройкиОператора.Ячейки.ВыгрузитьКолонку("Ячейка");
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Функция ПолучитьНастройкуОператораТСД(Оператор) Экспорт
	
	Если ТипЗнч(Оператор) = Тип("СправочникСсылка.вмс_НастройкиОператора") Тогда
		Возврат Оператор;
	КонецЕсли;
	
	НастройкиОператора = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор", Оператор);
	
	Если ЗначениеЗаполнено(НастройкиОператора) Тогда
		Возврат НастройкиОператора;	
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивОперацийОператора(Оператор, Отбор) Экспорт
	
	НастройкаОператора = ПолучитьНастройкуОператораТСД(Оператор);
	Если Не ЗначениеЗаполнено(НастройкаОператора) Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	|	вмс_НастройкиОператораОперации.Операция КАК Операция
	|ИЗ
	|	Справочник.вмс_НастройкиОператора.Операции КАК вмс_НастройкиОператораОперации
	|ГДЕ
	|	вмс_НастройкиОператораОперации.Ссылка = &НастройкаОператора";
	Запрос.УстановитьПараметр("НастройкаОператора", НастройкаОператора);
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|	И вмс_НастройкиОператораОперации.Операция." + ЭлементОтбора.Ключ + " = &" + ЭлементОтбора.Ключ;
		Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|СГРУППИРОВАТЬ ПО
	|	вмс_НастройкиОператораОперации.Операция";
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат.ВыгрузитьКолонку("Операция");	
	Иначе
		Возврат Новый Массив();	
	КонецЕсли;
	
КонецФункции

Функция НачальноеЗаполнениеМасштабаФормы() Экспорт
	
	Выборка = Справочники.вмс_НастройкиОператора.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ЭтоГруппа Тогда
			Оператор = Выборка.ПолучитьОбъект();
			Оператор.МасштабФормы = 100;
			Оператор.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецЕсли
